{
  "name": "Caphe House (Bermondsey Street)",
  "short_title": "Authentic Vietnamese pho, big flavours and cult egg coffee",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "Vietnamese"
  ],
  "category": [
    "Casual dining",
    "Café-restaurant",
    "Quick meals"
  ],
  "price_range": "££",
  "summary": "Caphe House is a much-loved Vietnamese café-restaurant on Bermondsey Street, widely praised for serving some of the best pho in London. It’s casual, welcoming and family-run in feel, with a menu built around deep aromatic broths, fresh herbs and generous bowls. Their cult egg coffee is another major draw, making it a go-to for comforting, flavour-packed meals throughout the day.",
  "what_diners_love": [
    "Exceptional pho broth—fragrant, light yet deeply flavourful",
    "Generous portions, especially noodle soups",
    "Authentic Vietnamese flavours praised by diners familiar with Vietnam",
    "Egg coffee: rich, velvety and often described as the best in the UK",
    "Friendly, efficient service with quick turnaround",
    "Strong vegetarian, vegan and gluten-free options"
  ],
  "popular_dishes": [
    "Rare beef & brisket pho",
    "Beef rib pho",
    "Seafood pho",
    "Chicken phở",
    "Bún bò Huế (spicy lemongrass noodle soup)",
    "Papaya salad with prawns",
    "Summer rolls (prawn, pork, tofu)",
    "Bánh mì",
    "Steamed pork buns",
    "Egg coffee",
    "Vietnamese iced coffee",
    "Jasmine iced tea"
  ],
  "atmosphere_experience": "Small, bright and relaxed with a calm daytime vibe and a steady buzz at meal times. The setup is efficient and casual, including QR-code ordering and fast service. Well suited to solo diners, families and casual catch-ups, though it isn’t designed for lingering long dinners.",
  "good_to_know": [
    "Pho is the headline act and what most diners come for",
    "Prices can be higher than some Vietnamese spots, but portions are usually generous",
    "Ordering and payment typically via QR code (no cash)",
    "Takeaway and delivery available (delivery timing depends on third-party apps)",
    "Egg coffee contains raw egg—important for allergies and dietary preferences",
    "Kid-friendly with accommodating staff"
  ],
  "mixed_feedback": [
    "Some diners find pho pricing high (often nearing £18–20)",
    "Occasional comments about inconsistency on non-pho dishes",
    "Limited seating at peak times"
  ],
  "best_for": [
    "Pho lovers",
    "Comforting noodle soups",
    "Casual lunches",
    "Solo dining",
    "Vietnamese coffee fans"
  ],
  "top_tip": "For a first visit, go straight for the rare beef & brisket pho and finish with an egg coffee—the combo most often described as unforgettable.",
  "booking": "walk_in"
}