{
  "name": "Fleurie (Bermondsey Street)",
  "short_title": "A cosy neighbourhood French bistro with small plates & big charm",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "French",
    "Bistro"
  ],
  "category": [
    "Neighbourhood bistro",
    "Small plates",
    "Wine-led"
  ],
  "price_range": "££",
  "summary": "Fleurie is a much-loved, intimate French bistro on Bermondsey Street that blends brasserie classics with a modern small-plates approach. Known for warm, personable service and a relaxed Parisian neighbourhood feel, it draws locals for everything from a glass of wine at the bar to casual lunches and celebratory dinners. The compact kitchen is often visible, adding a sense of theatre and connection.",
  "what_diners_love": [
    "Exceptionally friendly, attentive staff frequently praised by name",
    "Cosy, buzzy atmosphere with candles, jazz, and a village-like vibe",
    "Well-made French comfort food using good-quality produce",
    "Strong wine and cocktail list with confident staff guidance",
    "Good vegetarian options that are clearly labelled",
    "Bar seating and outdoor tables ideal for solo diners or casual visits"
  ],
  "popular_dishes": [
    "Cheese croquettes (flavour praised; portions divide opinion)",
    "Boeuf bourguignon",
    "Duck confit / duck cassoulet",
    "Moules frites",
    "Scallops",
    "Steak frites / bavette steak",
    "Chicken dishes (mushrooms, chicken chasseur, chicken parfait)",
    "French onion soup",
    "Apple pie",
    "Vegetarian small plates (pumpkin with goat’s cheese, French beans, mushroom croquettes)"
  ],
  "atmosphere_experience": "Small, intimate, and lively with a charming, romantic bistro energy. Ideal for dates, catch-ups, and relaxed celebrations. Tables are close together so it can feel cramped and noisy at peak times, but most diners see the buzz as part of the appeal. Bar seating and watching the kitchen in action are highlights for many regulars.",
  "good_to_know": [
    "Portions can be small (especially small plates); great for sharing but costs can add up if very hungry",
    "Very limited space: close seating and noticeable noise during busy services",
    "Time limits may apply at peak hours (not always clearly communicated)",
    "Air circulation can be an issue when full; cooking smells may linger",
    "Reservations recommended for evenings and weekends",
    "Dog-friendly"
  ],
  "best_for": [
    "Neighbourhood dining",
    "Date nights",
    "Wine-led evenings",
    "Small groups",
    "Vegetarians looking for French options",
    "Solo diners at the bar"
  ],
  "top_tip": "If you’re hungry, aim for 4–5 small plates between two people or combine small plates with a main. Bar seating is often the most relaxed way to experience Fleurie, especially without a booking.",
  "booking": "recommended"
}