{
  "name": "Bermondsey Corner (Bermondsey Street)",
  "short_title": "Intimate wine bar & deli with Parisian charm",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "Wine bar",
    "Deli",
    "Cheese & charcuterie"
  ],
  "category": [
    "Wine-led",
    "Aperitivo",
    "Date night",
    "Casual grazing"
  ],
  "price_range": "££",
  "summary": "Bermondsey Corner is a small, stylish wine bar and deli that shifts from coffee spot by day to candlelit wine bar by night. Diners consistently praise its exceptional wine selection, standout cheese and charcuterie boards, and genuinely warm, knowledgeable staff. It’s a favourite for dates, catch-ups and relaxed evenings—especially when terrace seating is available.",
  "what_diners_love": [
    "Outstanding wine selection, including natural, organic and small-producer bottles",
    "Knowledgeable, friendly staff offering tastings and spot-on recommendations",
    "High-quality cheese & charcuterie boards, beautifully presented",
    "Cosy, romantic atmosphere that feels intimate without being intimidating",
    "Cafe-by-day, wine-bar-by-night concept that locals return to regularly",
    "Outdoor seating popular in warm weather (near White Cube)"
  ],
  "popular_dishes": [
    "Cheese boards (often with fig jam, nuts and toasted bread)",
    "Charcuterie boards",
    "Fresh artisan bread & sourdough",
    "Rillettes",
    "Pâté",
    "Sardines",
    "Hummus",
    "Tapenade",
    "Chocolate biscuits and deli treats",
    "Pet-Nat",
    "Orange wine",
    "Sparkling wines",
    "Coffee"
  ],
  "atmosphere_experience": "Small, chic and intimate with eclectic furniture and a relaxed European feel. Noise levels are usually low to moderate (good for conversation), though it can feel buzzy at peak times. Seating is limited and some chairs are noted as less comfortable, but most diners find the charm and atmosphere worth it. Service is often described as personal, unpretentious and genuinely passionate about wine.",
  "good_to_know": [
    "Small venue with limited seating—bookings recommended on weekends",
    "Better for grazing than full meals (boards and deli plates rather than hot mains)",
    "Pricing reflects quality wines and artisan products",
    "Very wine-focused; non-alcoholic options exist but are less prominent",
    "Foie gras is sold, which some guests object to on ethical grounds",
    "Dog-friendly but space is tight (small dogs work best)",
    "Good option for takeaway bottles, cheese and deli goods"
  ],
  "mixed_feedback": [
    "A small number of reviews mention slow service or feeling rushed during very busy periods",
    "Ethical concerns raised by some guests about foie gras",
    "Not ideal for long comfortable sits if you want lots of space"
  ],
  "best_for": [
    "Date nights",
    "Wine lovers",
    "Post-work drinks",
    "Relaxed catch-ups",
    "Solo wine sipping",
    "European-style aperitivo vibes"
  ],
  "top_tip": "Tell the staff what you usually like (or don’t like)—their tastings and recommendations are a major strength and often help guests discover new favourite bottles.",
  "booking": "recommended"
}