{
  "name": "Pique-Nique (Tanner Street, Bermondsey)",
  "short_title": "Classic French sharing dishes in a hidden park-side setting",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "French"
  ],
  "category": [
    "Sharing mains",
    "Special occasion",
    "Wine-led dining"
  ],
  "price_range": "£££",
  "summary": "Pique-Nique is a well-established French restaurant tucked inside Tanner Street Park, often described as a hidden gem just off Bermondsey Street. Reviews consistently praise high-quality cooking, generous sharing mains, and an excellent wine list. It’s especially popular for special occasions, birthdays, and relaxed long lunches. The concept centres on individual starters and large mains designed to share—key to enjoying it properly.",
  "what_diners_love": [
    "High-quality French cooking, often compared to Michelin-level dining",
    "Generous sharing mains—many say you won’t leave hungry",
    "Exceptional wine list with knowledgeable staff and good by-the-glass options",
    "Warm, confident service with explanations of dishes and wine pairings",
    "Romantic, cosy atmosphere (conservatory frequently recommended)",
    "Unique park-side location with Shard views at sunset",
    "Excellent for celebrations (birthdays, anniversaries, weddings, family gatherings)"
  ],
  "popular_dishes": [
    "Chateaubriand (highly talked-about sharing main)",
    "Bar en croûte / Coulibiac (sea bass or salmon baked in pastry)",
    "Pâté en croûte",
    "Roast chicken with sauce",
    "Venison tartare",
    "Scallops",
    "Mussels",
    "Duck (Mallard)",
    "Chocolate soufflé",
    "Tarte tatin",
    "Mille-feuille",
    "Fig tart",
    "Baked Alaska"
  ],
  "atmosphere_experience": "Intimate, candle-lit and unmistakably French, with calm, grown-up energy. Seating includes a main dining room and a bright conservatory (often recommended). Despite being next to a playground, noise is usually low and relaxed, making it easy to talk. Works well for couples, groups and families—especially at lunch.",
  "good_to_know": [
    "Mains are designed to share (often for 3–4 people), not individual plates",
    "Higher price point, but portions are large and ingredients premium",
    "Booking strongly recommended, particularly on weekends",
    "Vegetarian mains limited, though starters are strong and the kitchen may adapt",
    "Traditional French cooking style—some dishes served as the chef intends (rare meat especially)",
    "Service mostly praised, but can occasionally feel brusque or inflexible when busy",
    "15% service charge is commonly added"
  ],
  "mixed_feedback": [
    "A small number of diners find certain dishes overpriced or inconsistent",
    "Occasional comments about overly rare meat, seasoning balance, or service attitude",
    "Best enjoyed if you embrace the sharing format and ask staff for guidance"
  ],
  "best_for": [
    "French food lovers",
    "Special occasions",
    "Wine enthusiasts",
    "Leisurely lunches",
    "Group dining",
    "Romantic dinners"
  ],
  "top_tip": "Lean into the format: order individual starters, then choose one or two sharing mains for the table. Ask staff for wine pairing guidance, and book the conservatory if possible.",
  "booking": "recommended"
}