{
  "name": "Sentosa (Bermondsey Street)",
  "short_title": "Busy, authentic Singapore/Malaysian comfort food in a tight room",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "Singaporean",
    "Malaysian"
  ],
  "category": [
    "Casual dining",
    "Comfort food",
    "Quick service"
  ],
  "price_range": "££",
  "summary": "Sentosa is a flavour-forward Singaporean/Malaysian restaurant on Bermondsey Street that stays busy most evenings. Diners repeatedly describe it as authentic (including reviewers who’ve lived in Singapore), with laksa, char kway teow and satay emerging as the consistent crowd-pleasers. Expect classic comfort food served fast in a lively, close-quarters setting.",
  "what_diners_love": [
    "Authentic Singapore/Malaysian flavours (often praised by diners familiar with Singapore)",
    "Laksa frequently described as close to the real deal (rich and sometimes spicy)",
    "Char kway teow with strong wok flavour (“wok hei” often mentioned)",
    "Chicken satay skewers as a go-to favourite",
    "Soft shell crab regularly called out as a standout",
    "Fast, efficient service even when packed",
    "Some reviewers note helpful dietary awareness (e.g., GF options and staff guidance)"
  ],
  "popular_dishes": [
    "Laksa",
    "Char kway teow / kuay teow",
    "Chicken satay skewers",
    "Hainan chicken rice",
    "Butter rice",
    "Soft shell crab"
  ],
  "drinks_highlights": [
    "Teh tarik",
    "Soya milk with grass jelly",
    "Lemon tea"
  ],
  "atmosphere_experience": "A small, busy dining room with lots of closely packed tables. It’s lively and often loud at peak times, which adds to the bustling vibe but can make conversation difficult. Service is typically quick and efficient.",
  "good_to_know": [
    "Cramped and noisy during peak hours; not ideal for quiet dinners",
    "Spice levels aren’t always clearly marked—ask staff if spice-sensitive",
    "Value perceptions vary: many find it good for the area, others find some specials London-pricey",
    "Service charge may be added; at least one review mentions confusion about whether it’s discretionary"
  ],
  "mixed_feedback": [
    "Some inconsistency reported across certain dishes (e.g., salted egg prawns disappointing to a reviewer; noodles sometimes soft; flavours occasionally called bland)",
    "Peanut sauce on satay can feel heavy for some diners",
    "Service charge handling mentioned as awkward in at least one review"
  ],
  "best_for": [
    "Singapore/Malaysian comfort food",
    "Laksa lovers",
    "Casual dinners",
    "Fast, flavour-led meals",
    "Groups who don’t mind noise"
  ],
  "top_tip": "To stack the odds, order the laksa, char kway teow, chicken satay and soft shell crab—and ask about spice levels before ordering if you prefer mild food.",
  "booking": "walk_in"
}