{
  "name": "Chapter 72 (Bermondsey Street)",
  "short_title": "Coffee by day, espresso martinis by night in a tiny, buzzy spot",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "Café",
    "Coffee",
    "Cocktail bar"
  ],
  "category": [
    "Coffee stop",
    "Casual",
    "Cocktails"
  ],
  "price_range": "££",
  "summary": "Chapter 72 is a small Bermondsey Street café that transitions into a cocktail bar, drawing locals for excellent coffee, pastries/sausage rolls, and a famously wide range of espresso martinis. Reviews are largely glowing on drinks and vibe, with drawbacks mainly around limited space, occasional service brusqueness when busy, and mixed feedback on some in-house breakfast items.",
  "what_diners_love": [
    "Consistently great coffee (lattes/flat whites; iced americano often praised)",
    "Espresso martinis with many flavours (often described as among the best)",
    "Sausage rolls and pastries frequently called incredible (also popular for catering)",
    "Friendly, welcoming staff on many visits (specific shoutouts to team members)",
    "Good music and upbeat vibe",
    "Handy location near London Bridge and Bermondsey Street galleries"
  ],
  "popular_dishes": [
    "Sausage rolls (pork & cheddar; pork & apple)",
    "Ham & cheese croissant",
    "Cinnamon roll / cinnamon bun",
    "Toasties / tuna melt (mixed feedback on filling size)",
    "Banana bread",
    "Pecan tart/pie",
    "Hot chocolate",
    "Breakfast wraps / egg & avocado bagel (reviews split)"
  ],
  "atmosphere_experience": "Cute, cosy and ideal for a quick pop-in, with window seating and a lively soundtrack. Can be calm mid-afternoon but busy and loud at peak times. Tables are tight—great for people-watching, less suited to long catch-ups when packed.",
  "good_to_know": [
    "Small space and very popular; you may feel rushed during busy periods",
    "Food feedback is inconsistent: baked goods and sausage rolls are standout; wraps/bagels get mixed reviews",
    "Some drinks are polarising (espresso martinis loved; matcha/pistachio latte receive some critiques)",
    "Many find it reasonable for the area, but a few items are described as pricey",
    "Vegetarian options exist but may be limited depending on the day"
  ],
  "mixed_feedback": [
    "Some visitors report brisk service when very busy",
    "Breakfast wraps/bagels are the most common food criticism",
    "Some toasties described as lightly filled"
  ],
  "best_for": [
    "Espresso martini fans",
    "Quality coffee stop",
    "Pastry/sausage-roll grab-and-go",
    "Casual pre-/post-Shard or gallery pit stop"
  ],
  "top_tip": "Stick to the coffee + pastries/sausage rolls (or the espresso martini menu at night). If you’re very hungry, consider skipping the breakfast wraps based on the most consistent negative feedback.",
  "booking": "walk_in"
}