{
  "name": "Lahpet Larder (Bermondsey Street)",
  "short_title": "Refined Burmese sharing plates with bold, vibrant flavours",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "Burmese",
    "Southeast Asian"
  ],
  "category": [
    "Sharing plates",
    "Date night",
    "Flavour-led dining"
  ],
  "price_range": "££",
  "summary": "Lahpet Larder brings modern Burmese cooking to Bermondsey Street in a warm, stylish and intimate setting. Diners praise its complex, punchy flavours, thoughtful presentation and friendly service. While opinions vary on portion size and value, it’s widely viewed as one of London’s best introductions to Burmese cuisine—especially for those who enjoy spice, texture and balance.",
  "what_diners_love": [
    "Bold, layered flavours balancing sour, spicy, sweet and savoury",
    "Signature salads, especially ginger salad and tea leaf salad",
    "Friendly, welcoming staff known for warmth and attentiveness",
    "Stylish, cosy interior suited to dates and small groups",
    "Good vegetarian selection that is clearly labelled",
    "Strong mocktails, cocktails and house iced teas"
  ],
  "popular_dishes": [
    "Ginger salad (unforgettable signature)",
    "Tea leaf salad (lahpet thoke)",
    "Coconut chicken noodles (light laksa-like dish)",
    "King prawn curry (huge flavour, smaller portion)",
    "Chicken rolls",
    "Sweetcorn & split pea fritters",
    "Salmon ceviche",
    "Kachin beef / rib-eye",
    "Coconut pandan sago pudding",
    "Fried dough sticks with milk tea sauce"
  ],
  "atmosphere_experience": "Relaxed, modern and intimate. Calm in the daytime with a livelier buzz in the evening. Noise is usually low to moderate but rises when full. The menu is designed for sharing, and many diners enjoy ordering widely to explore spice and texture. Food often arrives quickly, which some like and others find slightly rushed.",
  "good_to_know": [
    "Portions can be small, especially curries and seafood dishes",
    "Prices reflect flavour complexity and ingredients, though value opinions vary",
    "Some dishes can be spicy—ask staff for milder recommendations if needed",
    "Reservations recommended for evenings",
    "Lunch deals are often noted as particularly good value",
    "Wheelchair accessible, though tables may feel close together",
    "Not especially dog-friendly indoors"
  ],
  "mixed_feedback": [
    "A minority of diners feel dishes are overpriced for portion size",
    "Occasional comments about inconsistency across visits or specific dishes",
    "Service is usually excellent but can dip slightly when very busy"
  ],
  "best_for": [
    "Adventurous eaters",
    "Burmese cuisine newcomers",
    "Sharing plates",
    "Date nights",
    "Vegetarians",
    "Flavour-led dining"
  ],
  "top_tip": "Order at least one salad (ginger or tea leaf), one noodle or curry dish, and a dessert. For a first visit, the ginger salad + coconut noodles combo is the most consistently praised starting point.",
  "booking": "recommended"
}