{
  "name": "Bermondsey Bar & Kitchen (BBK)",
  "short_title": "Big vibes + beer garden venue (service/hygiene can be hit-or-miss)",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "Bar food",
    "Pub classics"
  ],
  "category": [
    "Large bar venue",
    "Beer garden",
    "Groups",
    "Sports nights"
  ],
  "price_range": "££",
  "summary": "Bermondsey Bar & Kitchen (BBK) is a large social bar venue with food rather than a destination restaurant. Reviews suggest it’s best approached as a drinks-first spot—popular for groups, DJs/live music, and a big outdoor beer garden. When it’s running well, guests love the atmosphere; when it’s not, feedback points to serious problems around service bottlenecks and cleanliness.",
  "what_diners_love": [
    "Spacious outdoor back garden/beer garden (a main reason people go)",
    "Great for groups, parties and long casual hangouts",
    "Lively vibe with music and busy social atmosphere",
    "Good pre-drinks/day-drinking spot near London Bridge",
    "Staff often described as friendly even when overwhelmed"
  ],
  "popular_dishes": [
    "Burgers",
    "Pizza",
    "Pub-style bar food"
  ],
  "atmosphere_experience": "A big, lively social venue with lots of seating and a popular outdoor garden. Noise levels are high when busy (especially sports nights). Designed for groups and social drinking more than quiet dining.",
  "good_to_know": [
    "Service can be very slow when busy (queues, limited bar staffing, long waits for drinks/food)",
    "QR/app ordering mentioned as slow or unreliable by some guests",
    "Food quality is inconsistent; best to keep expectations moderate",
    "Toilets frequently mentioned as needing improvement",
    "Can get loud, crowded and chaotic at peak times"
  ],
  "mixed_feedback": [
    "Multiple reports of food arriving cold or feeling average/overpriced",
    "Repeated cleanliness concerns in reviews, including mentions of mice and flies",
    "Staffing/service bottlenecks are a recurring complaint"
  ],
  "best_for": [
    "Groups and parties",
    "Beer garden drinks",
    "Lively nights out",
    "Pre-drinks near London Bridge",
    "Sports nights (if you like buzz)"
  ],
  "top_tip": "Treat BBK as drinks-first. Book ahead for groups and aim for the outdoor area; avoid peak Friday/sports times if you hate queues and slow service.",
  "booking": "recommended"
}