{
  "name": "Pizarro (Bermondsey Street)",
  "short_title": "Elevated Spanish dining from José Pizarro",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "Spanish",
    "Modern Spanish"
  ],
  "category": [
    "Refined dining",
    "Date night",
    "Celebrations",
    "Sharing plates"
  ],
  "price_range": "£££",
  "summary": "Pizarro is the flagship Bermondsey restaurant from acclaimed chef José Pizarro, offering a more refined, ingredient-led take on Spanish cuisine than his nearby tapas bar. Diners praise top-quality produce, confident cooking, and a lively yet polished atmosphere—making it a go-to for celebrations, date nights and some of London’s best Spanish dining.",
  "what_diners_love": [
    "Authentic Spanish flavours with a modern, elegant edge",
    "Exceptional quality meats, especially Ibérico pork and suckling lamb",
    "Standout desserts (dark chocolate mousse, Basque cheesecake frequently praised)",
    "Knowledgeable, professional service with excellent recommendations",
    "Chef’s counter seating for watching the kitchen in action",
    "Dog-friendly and welcoming for special occasions"
  ],
  "popular_dishes": [
    "Presa Ibérica / Ibérico pork (Cinco Jotas)",
    "Jamón Ibérico",
    "Croquetas (jamón and daily variations)",
    "Ox cheek (including cannelloni-style dishes)",
    "Suckling lamb leg",
    "Morcilla with cuttlefish",
    "Cod (bacalao)",
    "Mussels",
    "Padrón peppers",
    "Broken eggs with prawns",
    "Dark chocolate mousse",
    "Basque cheesecake"
  ],
  "atmosphere_experience": "Stylish, busy and energetic with a warm Spanish buzz that suits both intimate dinners and group celebrations. It can get loud at peak times, but many diners enjoy the lively feel. Chef’s counter seating is a highlight for food lovers. Service is typically attentive and polished, though some reviews mention inconsistency during very busy services.",
  "good_to_know": [
    "Reservations recommended, especially evenings and weekends",
    "Designed for sharing; ordering multiple dishes works best",
    "Higher price point (£60–100+ per person common), reflecting premium ingredients",
    "Wine and sherry list is strong but can feel pricey",
    "Vegetarian options exist, though the menu is meat- and seafood-led",
    "Can be busy and noisy, especially at dinner"
  ],
  "mixed_feedback": [
    "Some diners feel a few dishes don’t always justify the price (good rather than spectacular)",
    "Occasional comments about over-salting or uneven execution on certain seafood dishes",
    "Service warmth can vary depending on staff and crowd levels"
  ],
  "best_for": [
    "Spanish food lovers",
    "Special occasions",
    "Date nights",
    "Chef’s counter dining",
    "High-quality meat and seafood"
  ],
  "top_tip": "Book the chef’s counter if you can, and order across categories (meat + seafood + classic tapas) to get the best sense of the kitchen.",
  "booking": "recommended"
}