{
  "name": "Baccalà Seafood & Wine (London Bridge, Bermondsey Street)",
  "short_title": "Refined Italian seafood with a serious wine focus",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "Italian",
    "Seafood",
    "Wine bar"
  ],
  "category": [
    "Refined dining",
    "Date night",
    "Celebrations",
    "Wine-led"
  ],
  "price_range": "£££",
  "summary": "Baccalà Seafood & Wine is a polished seafood-led Italian restaurant on Bermondsey Street, praised for exceptional ingredients, thoughtful cooking and an outstanding wine programme. It’s often described as a more refined, grown-up alternative to nearby casual pasta spots—ideal for dates, celebrations and wine lovers who enjoy lingering over carefully paired dishes.",
  "what_diners_love": [
    "High-quality seafood, fresh and carefully cooked",
    "Excellent wine list with knowledgeable staff and strong by-the-glass options",
    "Top-tier tiramisu frequently described as one of the best in London",
    "Warm, attentive service with personalised wine guidance",
    "Authentic Italian flavours—modern but respectful of tradition",
    "Open-kitchen counter seating downstairs, popular with food lovers"
  ],
  "popular_dishes": [
    "Seafood pasta / Pentolaccia Scoglio",
    "Salt cod (baccalà), especially whipped or served with polenta",
    "Monkfish (standout dish)",
    "Octopus (carpaccio or roasted)",
    "Fried baby squid / calamari (dark-coated)",
    "Oysters",
    "Tuna tartare",
    "Tiramisu (must-order)"
  ],
  "atmosphere_experience": "Small, intimate and stylish with counter seating, tables upstairs, and a quieter downstairs kitchen lounge. Noise levels vary (lively upstairs, calmer below). Many diners enjoy watching the chefs at work. Overall it feels relaxed yet refined—suited to dates, anniversaries, business dinners and wine-focused evenings.",
  "good_to_know": [
    "Reservations strongly recommended, especially evenings and weekends",
    "Early bookings may come with a set table time",
    "Higher price point than nearby casual Italian spots (often £60–100+ per person)",
    "Service charge (~13.5%) is typically added (optional)",
    "Large groups may require set menus and pre-orders",
    "Portions are generally well-sized but the overall experience leans fine-dining",
    "Not particularly child-focused; better suited to adults"
  ],
  "mixed_feedback": [
    "A small number of reviews mention service issues such as feeling rushed late in the evening",
    "Some note rigid handling of large group bookings"
  ],
  "best_for": [
    "Seafood lovers",
    "Wine enthusiasts",
    "Date nights",
    "Anniversaries",
    "Business dinners",
    "Special occasions"
  ],
  "top_tip": "Let the team guide your wine choices and don’t skip dessert—the tiramisu is a must-order even for people who usually avoid dessert.",
  "booking": "recommended"
}