{
  "name": "Casse-Croûte (Bermondsey Street)",
  "short_title": "A tiny, transportive French bistro near London Bridge",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "French",
    "Bistro"
  ],
  "category": [
    "Date night",
    "Bistro",
    "Special occasion"
  ],
  "price_range": "£££",
  "summary": "Casse-Croûte is a tiny, candlelit French bistro on Bermondsey Street that regulars describe as “like being in France.” The menu is short and changes daily (often chalkboard-written and in French), focusing on classic, rich French cooking with generous portions. Expect confident wine recommendations, attentive service, and an intimate, close-quarters dining room ideal for a treat meal, date night, or long lunch.",
  "what_diners_love": [
    "Authentic French flavours that feel genuinely “Paris”",
    "Daily-changing seasonal menu with thoughtful cooking and quality ingredients",
    "Rich, indulgent classics done well and often beautifully presented",
    "Wine pairings and French aperitifs (kir/kir royale frequently praised)",
    "Warm, intimate candlelit ambiance—cozy and “magical”",
    "Staff who translate/explain the French menu and recommend dishes confidently"
  ],
  "popular_dishes": [
    "Boeuf en croûte / Beef Wellington (signature dish)",
    "Rabbit dishes (stuffed rabbit; rabbit with mustard sauce)",
    "Duck confit / duck dishes",
    "Cod (cabillaud) (mixed feedback)",
    "Lamb shoulder",
    "Crab/lobster ravioli with bisque",
    "Snails in pastry",
    "Potato gratin / dauphinoise",
    "Île flottante (floating island)",
    "Riz au lait",
    "Chocolate fondant",
    "Crêpe gâteau / crêpe-style desserts",
    "Apricot tart",
    "Millefeuille",
    "Crème brûlée"
  ],
  "atmosphere_experience": "A small, bustling bistro with a distinctly French feel—often with French spoken on the floor and a menu that may need quick translation. It’s charming and intimate, but tables are close and it can feel loud or cramped when busy. Many diners recommend leaning into the slower rhythm: linger over courses, share plates, and enjoy the full bistro experience.",
  "good_to_know": [
    "Menu is short and meat-forward; vegetarian options can be limited depending on the day",
    "Booking strongly recommended; walk-ins sometimes possible at the bar but not reliable",
    "Service style varies: usually attentive and friendly, though some find it more formal/impersonal",
    "Portions are generous; cooking can be rich/heavily seasoned (some mention saltiness on certain dishes)",
    "Often a special-occasion spend; wine can feel pricey to some diners",
    "Very small space: tight seating and can be noisy at peak times",
    "Accessibility concerns noted (at least one reviewer says it’s not suitable for wheelchairs)",
    "Parking nearby can be difficult"
  ],
  "best_for": [
    "Date nights",
    "French-food lovers",
    "Celebratory meals",
    "Anyone chasing a “Paris in London” bistro vibe",
    "Long lunches"
  ],
  "top_tip": "Go in with an open mind since the menu changes daily. If sharing, many diners suggest multiple starters + one main + dessert between two people to taste more of the menu.",
  "booking": "recommended"
}