{
  "name": "The Garrison (Bermondsey)",
  "short_title": "Seafood-led gastropub with standout Sunday roasts",
  "neighbourhood": [
    "Bermondsey",
    "London Bridge"
  ],
  "cuisine": [
    "British",
    "Gastropub",
    "Seafood"
  ],
  "category": [
    "Gastropub",
    "Sunday roast",
    "Neighbourhood dining"
  ],
  "price_range": "££",
  "summary": "The Garrison is a polished, food-forward gastropub just south of London Bridge that consistently punches above its pub exterior. Diners highlight serious cooking—especially seafood and Sunday roasts—served in a relaxed neighbourhood setting. With a strong service culture and an open, welcoming vibe, it suits celebratory dinners, long roasts, or casual drinks that turn into a full meal.",
  "what_diners_love": [
    "Exceptional food quality that feels restaurant-level rather than pub fare",
    "Seafood focus with fresh fish, oysters, scallops and daily specials",
    "One of the best Sunday roasts in the area with generous portions and strong execution",
    "Attentive, personable service (staff and chefs often named)",
    "Thoughtful dietary accommodation including vegetarian, vegan and gluten-free dishes",
    "Great atmosphere: lively but comfortable with booths, bar seating and terrace options"
  ],
  "popular_dishes": [
    "Sunday roast (beef, pork belly with crackling, vegetarian options)",
    "Scallops",
    "Oysters (including Maldon oysters)",
    "Fish & chips (noted for distinctive layered chips)",
    "Monkfish",
    "Plaice",
    "Sea bass",
    "Venison",
    "Steak",
    "Lamb cutlets",
    "Burrata",
    "Rum baba",
    "Lemon pistachio panna cotta",
    "Sticky toffee pudding",
    "Cheesecake"
  ],
  "atmosphere_experience": "A smart gastropub feel with genuine warmth. Indoors is cosy and bustling; outdoor seating is popular in warmer months. Service is polished without being formal. It can get busy and noisy at peak times—especially weekends and Sundays—which adds to the buzz but may not suit those seeking a quiet meal.",
  "good_to_know": [
    "Sunday roast is a major draw and books up quickly",
    "Seafood lovers will be happiest, though meat and vegetarian options are strong too",
    "Portion sizes vary: roasts are generous while some starters feel more refined",
    "Reservations recommended for evenings, weekends and Sundays",
    "Occasional service hiccups reported during very busy periods, but management responses are proactive",
    "Dog-friendly and family-friendly; staff often accommodate prams and children"
  ],
  "best_for": [
    "Sunday roasts",
    "Seafood fans",
    "Celebratory meals",
    "Neighbourhood dining",
    "Gastropub lovers who care about food"
  ],
  "top_tip": "For a first visit, go on a Sunday for the roast or ask to see the fresh fish selection—both are repeatedly highlighted as reasons people return.",
  "booking": "recommended"
}