{
  "name": "Sixes Social Cricket (London Bridge)",
  "short_title": "Cricket batting cages + sports bar vibe (service can be inconsistent)",
  "neighbourhood": [
    "London Bridge"
  ],
  "cuisine": [
    "Bar food",
    "Pub grub"
  ],
  "category": [
    "Activity venue",
    "Groups",
    "Sports bar"
  ],
  "price_range": "££",
  "summary": "Sixes Social Cricket combines cricket batting cages/simulators with a sports bar setting. Reviews suggest it’s a great idea and often a brilliant time—especially for corporate socials, birthdays and group nights—where the activity is the main event. The most common negatives relate to service/operations on busy slots, timekeeping/booking readiness, and food quality being fine but pricey. A smaller set of reviews raise cleanliness and toilet concerns.",
  "what_diners_love": [
    "Cricket nets/simulators are genuinely fun, even for beginners",
    "Great setup for group events, birthdays and work socials",
    "Lots of seating and screens for watching sport",
    "Lively, buzzy atmosphere that works well for parties",
    "Several standout staff members are repeatedly praised by name"
  ],
  "popular_dishes": [
    "Burgers",
    "Pub-style bar food"
  ],
  "atmosphere_experience": "A lively activity venue with a sports bar feel—busy, noisy and high-energy, especially during peak booking slots. Designed for groups and celebrations rather than quiet catch-ups.",
  "good_to_know": [
    "Arrive early, especially for busy slots (check-in delays and queues reported)",
    "Bookings may not always start on time during peak periods",
    "Food is commonly described as average/pub-grub for the price",
    "If sound/commentary matters to you, ask staff about audio policy before settling in"
  ],
  "mixed_feedback": [
    "Service and operations issues are the most common complaint (slow bar service, being ignored on arrival, chaotic when busy)",
    "Booking issues reported (waiting past slot time; one report of same-day cancellation)",
    "Music can be too loud; comfort issues noted (heat, low commentary volume)",
    "Pricing/value confusion reported (per-person charges, promo/discount frustrations)",
    "Toilet cleanliness issues mentioned; a few reviews claim pests/rodents sightings"
  ],
  "best_for": [
    "Work socials and Christmas parties",
    "Big groups",
    "Birthdays",
    "Cricket fans who want a sports bar vibe",
    "A 'do something' night out"
  ],
  "top_tip": "Treat this as an activity-first venue: arrive early, keep booking confirmation handy, and set food expectations to 'pub grub'. If it’s a special occasion, email ahead to reduce booking mix-up risk.",
  "booking": "required_for_activity"
}